TexasInstruments/f29h85x-sdk/source/driverlib/clockconfig.h
//###########################################################################
//
// FILE:   clock_config.h
//
// TITLE:  C29x system control driver (Clock Configurations).
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef CLOCK_H
#define CLOCK_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup clock_api Clocks
//! @{
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_types.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "cpu.h"
#include "debug.h"

//
// Default internal oscillator frequency, 10 MHz
//
#define SYSCTL_DEFAULT_OSC_FREQ     10000000U

//*****************************************************************************
//
//! The following are values that can be passed to Sysctl_setClock() as
//! \e oscSrc parameter
//
//*****************************************************************************
typedef enum
{
    SYSCTL_OSCSRC_OSC2      = 0x00,    // Internal Oscillator 2
    SYSCTL_OSCSRC_XTAL      = 0x01,    // External XTAL
    SYSCTL_OSCSRC_XTAL_SE   = 0x11,    // External XTAL Single-ended mode
    SYSCTL_OSCSRC_OSC1      = 0x02     // Internal Oscillator 1
} Sysctl_PLLClockSource;

//*****************************************************************************
//
//! The following are values that can be passed to Sysctl_setClock() as
//! \e pllConfig parameter
//
//*****************************************************************************
typedef enum
{
    SYSCTL_PLL_ENABLE,
    SYSCTL_PLL_DISABLE,
    SYSCTL_PLL_BYPASS,
} Sysctl_PLLConfig;

//*****************************************************************************
//
//! The following are values that can be passed to Sysctl_setClock() as
//! \e refdiv parameter
//
//*****************************************************************************
typedef enum
{
    SYSCTL_REFDIV_1,
    SYSCTL_REFDIV_2,
    SYSCTL_REFDIV_3,
    SYSCTL_REFDIV_4,
    SYSCTL_REFDIV_5,
    SYSCTL_REFDIV_6,
    SYSCTL_REFDIV_7,
    SYSCTL_REFDIV_8,
    SYSCTL_REFDIV_9,
    SYSCTL_REFDIV_10,
    SYSCTL_REFDIV_11,
    SYSCTL_REFDIV_12,
    SYSCTL_REFDIV_13,
    SYSCTL_REFDIV_14,
    SYSCTL_REFDIV_15,
    SYSCTL_REFDIV_16,
    SYSCTL_REFDIV_17,
    SYSCTL_REFDIV_18,
    SYSCTL_REFDIV_19,
    SYSCTL_REFDIV_20,
    SYSCTL_REFDIV_21,
    SYSCTL_REFDIV_22,
    SYSCTL_REFDIV_23,
    SYSCTL_REFDIV_24,
    SYSCTL_REFDIV_25,
    SYSCTL_REFDIV_26,
    SYSCTL_REFDIV_27,
    SYSCTL_REFDIV_28,
    SYSCTL_REFDIV_29,
    SYSCTL_REFDIV_30,
    SYSCTL_REFDIV_31,
    SYSCTL_REFDIV_32,
} Sysctl_PLLRefDiv;

//*****************************************************************************
//
//! The following are values that can be passed to Sysctl_setClock() as
//! \e imult parameter
//
//*****************************************************************************
typedef enum
{
    SYSCTL_IMULT_4 = 4,
    SYSCTL_IMULT_5,
    SYSCTL_IMULT_6,
    SYSCTL_IMULT_7,
    SYSCTL_IMULT_8,
    SYSCTL_IMULT_9,
    SYSCTL_IMULT_10,
    SYSCTL_IMULT_11,
    SYSCTL_IMULT_12,
    SYSCTL_IMULT_13,
    SYSCTL_IMULT_14,
    SYSCTL_IMULT_15,
    SYSCTL_IMULT_16,
    SYSCTL_IMULT_17,
    SYSCTL_IMULT_18,
    SYSCTL_IMULT_19,
    SYSCTL_IMULT_20,
    SYSCTL_IMULT_21,
    SYSCTL_IMULT_22,
    SYSCTL_IMULT_23,
    SYSCTL_IMULT_24,
    SYSCTL_IMULT_25,
    SYSCTL_IMULT_26,
    SYSCTL_IMULT_27,
    SYSCTL_IMULT_28,
    SYSCTL_IMULT_29,
    SYSCTL_IMULT_30,
    SYSCTL_IMULT_31,
    SYSCTL_IMULT_32,
    SYSCTL_IMULT_33,
    SYSCTL_IMULT_34,
    SYSCTL_IMULT_35,
    SYSCTL_IMULT_36,
    SYSCTL_IMULT_37,
    SYSCTL_IMULT_38,
    SYSCTL_IMULT_39,
    SYSCTL_IMULT_40,
    SYSCTL_IMULT_41,
    SYSCTL_IMULT_42,
    SYSCTL_IMULT_43,
    SYSCTL_IMULT_44,
    SYSCTL_IMULT_45,
    SYSCTL_IMULT_46,
    SYSCTL_IMULT_47,
    SYSCTL_IMULT_48,
    SYSCTL_IMULT_49,
    SYSCTL_IMULT_50,
    SYSCTL_IMULT_51,
    SYSCTL_IMULT_52,
    SYSCTL_IMULT_53,
    SYSCTL_IMULT_54,
    SYSCTL_IMULT_55,
    SYSCTL_IMULT_56,
    SYSCTL_IMULT_57,
    SYSCTL_IMULT_58,
    SYSCTL_IMULT_59,
    SYSCTL_IMULT_60,
    SYSCTL_IMULT_61,
    SYSCTL_IMULT_62,
    SYSCTL_IMULT_63,
    SYSCTL_IMULT_64,
    SYSCTL_IMULT_65,
    SYSCTL_IMULT_66,
    SYSCTL_IMULT_67,
    SYSCTL_IMULT_68,
    SYSCTL_IMULT_69,
    SYSCTL_IMULT_70,
    SYSCTL_IMULT_71,
    SYSCTL_IMULT_72,
    SYSCTL_IMULT_73,
    SYSCTL_IMULT_74,
    SYSCTL_IMULT_75,
    SYSCTL_IMULT_76,
    SYSCTL_IMULT_77,
    SYSCTL_IMULT_78,
    SYSCTL_IMULT_79,
    SYSCTL_IMULT_80,
    SYSCTL_IMULT_81,
    SYSCTL_IMULT_82,
    SYSCTL_IMULT_83,
    SYSCTL_IMULT_84,
    SYSCTL_IMULT_85,
    SYSCTL_IMULT_86,
    SYSCTL_IMULT_87,
    SYSCTL_IMULT_88,
    SYSCTL_IMULT_89,
    SYSCTL_IMULT_90,
    SYSCTL_IMULT_91,
    SYSCTL_IMULT_92,
    SYSCTL_IMULT_93,
    SYSCTL_IMULT_94,
    SYSCTL_IMULT_95,
    SYSCTL_IMULT_96,
    SYSCTL_IMULT_97,
    SYSCTL_IMULT_98,
    SYSCTL_IMULT_99,
    SYSCTL_IMULT_100,
    SYSCTL_IMULT_101,
    SYSCTL_IMULT_102,
    SYSCTL_IMULT_103,
    SYSCTL_IMULT_104,
    SYSCTL_IMULT_105,
    SYSCTL_IMULT_106,
    SYSCTL_IMULT_107,
    SYSCTL_IMULT_108,
    SYSCTL_IMULT_109,
    SYSCTL_IMULT_110,
    SYSCTL_IMULT_111,
    SYSCTL_IMULT_112,
    SYSCTL_IMULT_113,
    SYSCTL_IMULT_114,
    SYSCTL_IMULT_115,
    SYSCTL_IMULT_116,
    SYSCTL_IMULT_117,
    SYSCTL_IMULT_118,
    SYSCTL_IMULT_119,
    SYSCTL_IMULT_120,
    SYSCTL_IMULT_121,
    SYSCTL_IMULT_122,
    SYSCTL_IMULT_123,
    SYSCTL_IMULT_124,
    SYSCTL_IMULT_125,
    SYSCTL_IMULT_126,
    SYSCTL_IMULT_127,
} Sysctl_PLLIMult;


//*****************************************************************************
//
//! The following are values that can be passed to Sysctl_setClock() as
//! \e odiv parameter
//
//*****************************************************************************
typedef enum
{
    SYSCTL_ODIV_1,
    SYSCTL_ODIV_2,
    SYSCTL_ODIV_3,
    SYSCTL_ODIV_4,
    SYSCTL_ODIV_5,
    SYSCTL_ODIV_6,
    SYSCTL_ODIV_7,
    SYSCTL_ODIV_8,
    SYSCTL_ODIV_9,
    SYSCTL_ODIV_10,
    SYSCTL_ODIV_11,
    SYSCTL_ODIV_12,
    SYSCTL_ODIV_13,
    SYSCTL_ODIV_14,
    SYSCTL_ODIV_15,
    SYSCTL_ODIV_16,
    SYSCTL_ODIV_17,
    SYSCTL_ODIV_18,
    SYSCTL_ODIV_19,
    SYSCTL_ODIV_20,
    SYSCTL_ODIV_21,
    SYSCTL_ODIV_22,
    SYSCTL_ODIV_23,
    SYSCTL_ODIV_24,
    SYSCTL_ODIV_25,
    SYSCTL_ODIV_26,
    SYSCTL_ODIV_27,
    SYSCTL_ODIV_28,
    SYSCTL_ODIV_29,
    SYSCTL_ODIV_30,
    SYSCTL_ODIV_31,
    SYSCTL_ODIV_32,
} Sysctl_PLLODiv;

//*****************************************************************************
//
//! The following are values that can be passed to Sysctl_setClock() as
//! \e sysdiv parameter
//
//*****************************************************************************
typedef enum
{
    SYSCTL_SYSDIV_1,
    SYSCTL_SYSDIV_2,
    SYSCTL_SYSDIV_3,
    SYSCTL_SYSDIV_4,
    SYSCTL_SYSDIV_5,
    SYSCTL_SYSDIV_6,
    SYSCTL_SYSDIV_7,
    SYSCTL_SYSDIV_8,
    SYSCTL_SYSDIV_9,
    SYSCTL_SYSDIV_10,
    SYSCTL_SYSDIV_11,
    SYSCTL_SYSDIV_12,
    SYSCTL_SYSDIV_13,
    SYSCTL_SYSDIV_14,
    SYSCTL_SYSDIV_15,
    SYSCTL_SYSDIV_16,
    SYSCTL_SYSDIV_17,
    SYSCTL_SYSDIV_18,
    SYSCTL_SYSDIV_19,
    SYSCTL_SYSDIV_20,
    SYSCTL_SYSDIV_21,
    SYSCTL_SYSDIV_22,
    SYSCTL_SYSDIV_23,
    SYSCTL_SYSDIV_24,
    SYSCTL_SYSDIV_25,
    SYSCTL_SYSDIV_26,
    SYSCTL_SYSDIV_27,
    SYSCTL_SYSDIV_28,
    SYSCTL_SYSDIV_29,
    SYSCTL_SYSDIV_30,
    SYSCTL_SYSDIV_31,
    SYSCTL_SYSDIV_32,
    SYSCTL_SYSDIV_33,
    SYSCTL_SYSDIV_34,
    SYSCTL_SYSDIV_35,
    SYSCTL_SYSDIV_36,
    SYSCTL_SYSDIV_37,
    SYSCTL_SYSDIV_38,
    SYSCTL_SYSDIV_39,
    SYSCTL_SYSDIV_40,
    SYSCTL_SYSDIV_41,
    SYSCTL_SYSDIV_42,
    SYSCTL_SYSDIV_43,
    SYSCTL_SYSDIV_44,
    SYSCTL_SYSDIV_45,
    SYSCTL_SYSDIV_46,
    SYSCTL_SYSDIV_47,
    SYSCTL_SYSDIV_48,
    SYSCTL_SYSDIV_49,
    SYSCTL_SYSDIV_50,
    SYSCTL_SYSDIV_51,
    SYSCTL_SYSDIV_52,
    SYSCTL_SYSDIV_53,
    SYSCTL_SYSDIV_54,
    SYSCTL_SYSDIV_55,
    SYSCTL_SYSDIV_56,
    SYSCTL_SYSDIV_57,
    SYSCTL_SYSDIV_58,
    SYSCTL_SYSDIV_59,
    SYSCTL_SYSDIV_60,
    SYSCTL_SYSDIV_61,
    SYSCTL_SYSDIV_62,
    SYSCTL_SYSDIV_63,
    SYSCTL_SYSDIV_64,
} Sysctl_PLLSysDiv;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_selectClockOutSource() as the \e source parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_XCLKOUT_SOURCE_PLLSYS     = 0U,   //!< PLL System Clock post SYSCLKDIV
    SYSCTL_XCLKOUT_SOURCE_CPU1CLK    = 1U,   //!< CPU1.CLOCK
    SYSCTL_XCLKOUT_SOURCE_CPU2CLK    = 2U,   //!< CPU2.CLOCK
    SYSCTL_XCLKOUT_SOURCE_CPU3CLK    = 3U,   //!< CPU3.CLOCK
    SYSCTL_XCLKOUT_SOURCE_INTOSC1    = 5U,   //!< Internal Oscillator 1
    SYSCTL_XCLKOUT_SOURCE_INTOSC2    = 6U,   //!< Internal Oscillator 2
    SYSCTL_XCLKOUT_SOURCE_XTALOSC    = 7U,   //!< External Oscillator
} SysCtl_XClkSource;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setXClk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_XCLKOUT_DIV_1  = 0,      //!<  XCLKOUT =  XCLKOUT source / 1
    SYSCTL_XCLKOUT_DIV_2  = 1,      //!<  XCLKOUT =  XCLKOUT source / 2
    SYSCTL_XCLKOUT_DIV_4  = 2,      //!<  XCLKOUT =  XCLKOUT source / 4
    SYSCTL_XCLKOUT_DIV_8  = 3       //!<  XCLKOUT =  XCLKOUT source / 8
}SysCtl_XClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setMCANClock() as \e mcanInst parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_MCAN_A,
    SYSCTL_MCAN_B,
    SYSCTL_MCAN_C,
    SYSCTL_MCAN_D,
    SYSCTL_MCAN_E,
    SYSCTL_MCAN_F
}SysCtl_MCANInstance;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setMCANClock() as \e clksrc parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_MCANCLK_SOURCE_SYS       = 0x0, //! Peripheral System Clock Source
    SYSCTL_MCANCLK_SOURCE_AUXIN     = 0x2, //! Auxiliary Clock Input Source (GPIO)
    SYSCTL_MCANCLK_SOURCE_PLLRAW    = 0x3, //! PLL Raw Clock Source
    SYSCTL_MCANCLK_SOURCE_PLLCLK    = 0x3  //! PLL Raw Clock Source
}SysCtl_MCANClkSource;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setMCANClock() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_MCANCLK_DIV_1  = 0x0,   //!<  MCAN clock =  MCAN clock source / 1
    SYSCTL_MCANCLK_DIV_2  = 0x1,   //!<  MCAN clock =  MCAN clock source / 2
    SYSCTL_MCANCLK_DIV_3  = 0x2,   //!<  MCAN clock =  MCAN clock source / 3
    SYSCTL_MCANCLK_DIV_4  = 0x3,   //!<  MCAN clock =  MCAN clock source / 4
    SYSCTL_MCANCLK_DIV_5  = 0x4,   //!<  MCAN clock =  MCAN clock source / 5
    SYSCTL_MCANCLK_DIV_6  = 0x5,   //!<  MCAN clock =  MCAN clock source / 6
    SYSCTL_MCANCLK_DIV_7  = 0x6,   //!<  MCAN clock =  MCAN clock source / 7
    SYSCTL_MCANCLK_DIV_8  = 0x7,   //!<  MCAN clock =  MCAN clock source / 8
    SYSCTL_MCANCLK_DIV_9  = 0x8,   //!<  MCAN clock =  MCAN clock source / 9
    SYSCTL_MCANCLK_DIV_10 = 0x9,   //!<  MCAN clock =  MCAN clock source / 10
    SYSCTL_MCANCLK_DIV_11 = 0xA,   //!<  MCAN clock =  MCAN clock source / 11
    SYSCTL_MCANCLK_DIV_12 = 0xB,   //!<  MCAN clock =  MCAN clock source / 12
    SYSCTL_MCANCLK_DIV_13 = 0xC,   //!<  MCAN clock =  MCAN clock source / 13
    SYSCTL_MCANCLK_DIV_14 = 0xD,   //!<  MCAN clock =  MCAN clock source / 14
    SYSCTL_MCANCLK_DIV_15 = 0xE,   //!<  MCAN clock =  MCAN clock source / 15
    SYSCTL_MCANCLK_DIV_16 = 0xF,   //!<  MCAN clock =  MCAN clock source / 16
    SYSCTL_MCANCLK_DIV_17 = 0x10,  //!<  MCAN clock =  MCAN clock source / 17
    SYSCTL_MCANCLK_DIV_18 = 0x11,  //!<  MCAN clock =  MCAN clock source / 18
    SYSCTL_MCANCLK_DIV_19 = 0x12,  //!<  MCAN clock =  MCAN clock source / 19
    SYSCTL_MCANCLK_DIV_20 = 0x13   //!<  MCAN clock =  MCAN clock source / 20
}SysCtl_MCANClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_setCputimer2Clock()
//! as \e source parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_TIMER2CLK_SOURCE_SYSCLK   = 0U,   //!< System Clock
    SYSCTL_TIMER2CLK_SOURCE_INTOSC1  = 1U,   //!< Internal Oscillator 1
    SYSCTL_TIMER2CLK_SOURCE_INTOSC2  = 2U,   //!< Internal Oscillator 2
    SYSCTL_TIMER2CLK_SOURCE_XTAL     = 3U,   //!< Crystal oscillator
}SysCtl_Cputimer2ClkSource;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setCputimer2Clk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_TIMER2CLK_DIV_1  = 0,  //!<  Cputimer2 clock =  Cputimer2 clock / 1
    SYSCTL_TIMER2CLK_DIV_2  = 1,  //!<  Cputimer2 clock =  Cputimer2 clock / 2
    SYSCTL_TIMER2CLK_DIV_4  = 2,  //!<  Cputimer2 clock =  Cputimer2 clock / 4
    SYSCTL_TIMER2CLK_DIV_8  = 3,  //!<  Cputimer2 clock =  Cputimer2 clock / 8
    SYSCTL_TIMER2CLK_DIV_16 = 4   //!<  Cputimer2 clock =  Cputimer2 clock / 16
}SysCtl_Cputimer2ClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_setEPWMClockDivider()
//! as the \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_EPWMCLK_DIV_1,           //!< EPWMCLK = PLLSYSCLK / 1
    SYSCTL_EPWMCLK_DIV_2            //!< EPWMCLK = PLLSYSCLK / 2
} SysCtl_EPWMClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setEMIF1Clock() as the \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_EMIFCLK_DIV_1,         //!< EMIF1CLK = PLLSYSCLK / 1
    SYSCTL_EMIFCLK_DIV_2,         //!< EMIF1CLK = PLLSYSCLK / 2
    SYSCTL_EMIFCLK_DIV_4          //!< EMIF1CLK = PLLSYSCLK / 4
} SysCtl_EMIFClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_setLINAClockDivider()
//! as the \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_LINCLK_DIV_1,           //!< LINACLK = PLLSYSCLK / 1
    SYSCTL_LINCLK_DIV_2,           //!< LINACLK = PLLSYSCLK / 2
    SYSCTL_LINCLK_DIV_4            //!< LINACLK = PLLSYSCLK / 4
} SysCtl_LINClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setECatClock() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_ECATCLKOUT_DIV_1,      //!<  ECat clock =  PLLCLK / 1
    SYSCTL_ECATCLKOUT_DIV_2,      //!<  ECat clock =  PLLCLK / 2
    SYSCTL_ECATCLKOUT_DIV_3,      //!<  ECat clock =  PLLCLK / 3
    SYSCTL_ECATCLKOUT_DIV_4,      //!<  ECat clock =  PLLCLK / 4
    SYSCTL_ECATCLKOUT_DIV_5,      //!<  ECat clock =  PLLCLK / 5
    SYSCTL_ECATCLKOUT_DIV_6,      //!<  ECat clock =  PLLCLK / 6
    SYSCTL_ECATCLKOUT_DIV_7,      //!<  ECat clock =  PLLCLK / 7
    SYSCTL_ECATCLKOUT_DIV_8       //!<  ECat clock =  PLLCLK / 8
}SysCtl_ECatClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setECatClock() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_ECAT_PHYCLK_ENABLE = SYSCTL_ETHERCATCLKCTL_PHYCLKEN,
    SYSCTL_ECAT_PHYCLK_DISABLE = 0U,
}SysCtl_ECatPhyClk;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setCLBClock() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_CLBCLKOUT_DIV_1,      //!<  CLB clock =  CLB clock / 1
    SYSCTL_CLBCLKOUT_DIV_2,      //!<  CLB clock =  CLB clock / 2
    SYSCTL_CLBCLKOUT_DIV_3,      //!<  CLB clock =  CLB clock / 3
    SYSCTL_CLBCLKOUT_DIV_4,      //!<  CLB clock =  CLB clock / 4
    SYSCTL_CLBCLKOUT_DIV_5,      //!<  CLB clock =  CLB clock / 5
    SYSCTL_CLBCLKOUT_DIV_6,      //!<  CLB clock =  CLB clock / 6
    SYSCTL_CLBCLKOUT_DIV_7,      //!<  CLB clock =  CLB clock / 7
    SYSCTL_CLBCLKOUT_DIV_8       //!<  CLB clock =  CLB clock / 8
}SysCtl_CLBClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setCLBClock() as \e tdivider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_CLBTCLKOUT_DIV_1,      //!<  CLBTCLKOUT =  CLB clock / 1
    SYSCTL_CLBTCLKOUT_DIV_2       //!<  CLBTCLKOUT =  CLB clock / 2
}SysCtl_CLBTClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setHSMClock() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_HSMCLK_DIV_1,      //!<  HSM Clock =  HSM clock / 1
    SYSCTL_HSMCLK_DIV_2,      //!<  HSM Clock =  HSM clock / 2
    SYSCTL_HSMCLK_DIV_4,      //!<  HSM Clock =  HSM clock / 4
    SYSCTL_HSMCLK_DIV_8,      //!<  HSM Clock =  HSM clock / 8
    SYSCTL_HSMCLK_DIV_16,     //!<  HSM Clock =  HSM clock / 16
}SysCtl_HSMClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setCLBClock() as \e cpuInst parameter.
//
//*****************************************************************************

#define SYSCTL_CLB1CLKMODE_SYNC  0U,
#define SYSCTL_CLB1CLKMODE_ASYNC SYSCTL_CLBCLKCTL_CLKMODECLB1,
#define SYSCTL_CLB2CLKMODE_SYNC  0U,
#define SYSCTL_CLB2CLKMODE_ASYNC SYSCTL_CLBCLKCTL_CLKMODECLB2,
#define SYSCTL_CLB3CLKMODE_SYNC  0U,
#define SYSCTL_CLB3CLKMODE_ASYNC SYSCTL_CLBCLKCTL_CLKMODECLB3,
#define SYSCTL_CLB4CLKMODE_SYNC  0U,
#define SYSCTL_CLB4CLKMODE_ASYNC SYSCTL_CLBCLKCTL_CLKMODECLB4,
#define SYSCTL_CLB5CLKMODE_SYNC  0U,
#define SYSCTL_CLB5CLKMODE_ASYNC SYSCTL_CLBCLKCTL_CLKMODECLB5,
#define SYSCTL_CLB6CLKMODE_SYNC  0U,
#define SYSCTL_CLB6CLKMODE_ASYNC SYSCTL_CLBCLKCTL_CLKMODECLB6

//
// Defined in sysctl.c
//
extern void SysCtl_pollSyncBusy(uint32_t mask);

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************

//*****************************************************************************
//
//! Enable the missing clock detection (MCD) Logic
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_enableMCD")))
static inline void
SysCtl_enableMCD(void)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_MCDCR) &= ~(SYSCTL_MCDCR_MCLKOFF);
}

//*****************************************************************************
//
//! Disable the missing clock detection (MCD) Logic
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_disableMCD")))
static inline void
SysCtl_disableMCD(void)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_MCDCR) |= SYSCTL_MCDCR_MCLKOFF;
}

//*****************************************************************************
//
//! Get the missing clock detection Failure Status
//!
//! \note A failure means the oscillator clock is missing
//!
//! \return Returns \b true if a failure is detected or \b false if a
//! failure isn't detected
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_isMCDClockFailureDetected")))
static inline bool
SysCtl_isMCDClockFailureDetected(void)
{
    //
    //  Check the status bit to determine failure
    //
    return((HWREGH(DEVCFG_BASE + SYSCTL_O_MCDCR) & SYSCTL_MCDCR_MCLKSTS) != 0U);
}

//*****************************************************************************
//
//! Reset the missing clock detection logic after clock failure
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_resetMCD")))
static inline void
SysCtl_resetMCD(void)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_MCDCR) |= SYSCTL_MCDCR_MCLKCLR;
}

//*****************************************************************************
//
//! Re-connect missing clock detection clock source to stop simulating clock
//! failure
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_connectMCDClockSource")))
static inline void
SysCtl_connectMCDClockSource(void)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_MCDCR) &= ~(SYSCTL_MCDCR_OSCOFF);
}

