TexasInstruments/f29h85x-sdk/source/driverlib/clockconfig.h
//*****************************************************************************
//
//! Disconnect missing clock detection clock source to simulate clock failure.
//! This is for testing the MCD functionality.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_disconnectMCDClockSource")))
static inline void
SysCtl_disconnectMCDClockSource(void)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_MCDCR) |= SYSCTL_MCDCR_OSCOFF;
}

//*****************************************************************************
//
//! Sets up XCLK (External Clock out)
//!
//! \param clksrc   is the clock source to be used for the External Clock out
//! \param divider  is the clock divider to be used
//!
//! This function configures the specified clock source to be muxed to an
//! external clock out (XCLKOUT) GPIO pin.
//!
//! The \e clksrc arameter can have one enumerated value from
//! SysCtl_XClkSource
//! The \e divider parameter can have one enumerated value from
//! SysCtl_XClkDivider
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setXClk")))
static inline void
SysCtl_setXClk(SysCtl_XClkSource clksrc, SysCtl_XClkDivider divider)
{
    //
    // Configure the clock divider
    //
    HWREG(DEVCFG_BASE + SYSCTL_O_XCLKOUTDIVSEL) = divider;

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_XCLKOUTDIVSEL);

    //
    // Configure the clock source
    //
    HWREG(DEVCFG_BASE + SYSCTL_O_CLKSRCCTL3) =
            (HWREG(DEVCFG_BASE + SYSCTL_O_CLKSRCCTL3) &
             ~SYSCTL_CLKSRCCTL3_XCLKOUTSEL_M) |
            ((uint16_t)clksrc << SYSCTL_CLKSRCCTL3_XCLKOUTSEL_S);

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_CLKSRCCTL3);
}

//*****************************************************************************
//
//! Sets up MCAN Clock.
//!
//! \param mcanInst is the MCAN instance
//! \param clksrc   is the clock source to be used for the MCAN instance
//! \param divider  is the clock divider to be used
//!
//! This function sets up the MCANCLK divider. There is only one
//! divider that scales MCAN clock.
//!
//! The \e mcanInst parameter can have one enumerated value from
//! SysCtl_MCANInstance
//! The \e clksrc arameter can have one enumerated value from
//! SysCtl_MCANClkSource
//! The \e divider parameter can have one enumerated value from
//! SysCtl_MCANClkDivider
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setMCANClock")))
static inline void
SysCtl_setMCANClock(SysCtl_MCANInstance mcanInst, SysCtl_MCANClkSource clksrc,
                    SysCtl_MCANClkDivider divider)
{
    uint8_t bitpos;

    //
    // Configure the clock divider
    //
    bitpos = 5U * (uint8_t)mcanInst;
    HWREG(DEVCFG_BASE + SYSCTL_O_MCANCLKDIVSEL) =
            (HWREG(DEVCFG_BASE + SYSCTL_O_MCANCLKDIVSEL) &
             ~(SYSCTL_MCANCLKDIVSEL_MCANACLKDIV_M << bitpos)) |
            ((uint16_t)divider << bitpos);

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_MCANCLKDIVSEL);

    //
    // Configure the clock source
    //
    bitpos = SYSCTL_CLKSRCCTL2_MCANABCLKSEL_S + 2U * (uint8_t)mcanInst;
    HWREG(DEVCFG_BASE + SYSCTL_O_CLKSRCCTL2) =
            (HWREG(DEVCFG_BASE + SYSCTL_O_CLKSRCCTL2) & ~(0x3U << bitpos)) |
            ((uint16_t)clksrc << bitpos);

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_CLKSRCCTL2);
}

//*****************************************************************************
//
//! Sets up CPU Timer 2 Clock.
//!
//! \param divider is the value that configures the divider.
//! \param source is the source for the clock divider
//!
//! This function sets up the CPU Timer 2 CLK divider based on the source that
//! is selected. There is only one divider that scales the "source" to
//! CPU Timer 2 CLK.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_Cputimer2ClkDivider
//! The \e source parameter can have one enumerated value from
//! SysCtl_Cputimer2ClkSource
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setCputimer2Clock")))
static inline void
SysCtl_setCputimer2Clock(SysCtl_Cputimer2ClkSource source,
                         SysCtl_Cputimer2ClkDivider divider)
{
    HWREGH(CPUSYS_BASE + SYSCTL_O_TMR2CLKCTL) =
        (HWREGH(CPUSYS_BASE + SYSCTL_O_TMR2CLKCTL) &
            ~(SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_M |
              SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_M)) |
        ((uint16_t)divider << SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_S) |
        ((uint16_t)source << SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_S);
}

//*****************************************************************************
//
//! Sets the ePWM clock.
//!
//! \param divider is the value by which PLLSYSCLK is divided
//!
//! This function configures the clock rate of the EPWMCLK. The
//! \e divider parameter is the value by which the SYSCLK rate is divided to
//! get the EPWMCLK rate. For example, \b SYSCTL_EPWMCLK_DIV_2 will select an
//! EPWMCLK rate that is half the PLLSYSCLK rate.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setEPWMClock")))
static inline void
SysCtl_setEPWMClock(SysCtl_EPWMClkDivider divider)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) =
        (HWREGH(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) &
         ~SYSCTL_PERCLKDIVSEL_EPWMCLKDIV_M) | (uint16_t)divider;

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_PERCLKDIVSEL);
}

//*****************************************************************************
//
//! Sets the EMIF1 clock.
//!
//! \param divider is the value by which PLLSYSCLK (or CPU1.SYSCLK on a dual
//! core device) is divided
//!
//! This function configures the clock rate of the EMIF1CLK. The
//! \e divider parameter is the value by which the SYSCLK rate is divided to
//! get the EMIF1CLK rate.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setEMIF1Clock")))
static inline void
SysCtl_setEMIF1Clock(SysCtl_EMIFClkDivider divider)
{
    HWREG(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) =
            (HWREG(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) &
                ~SYSCTL_PERCLKDIVSEL_EMIF1CLKDIV_M) |
            ((uint32_t)divider << SYSCTL_PERCLKDIVSEL_EMIF1CLKDIV_S);

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_PERCLKDIVSEL);
}

//*****************************************************************************
//
//! Sets the LINA clock divider.
//!
//! \param divider is the value by which PLLSYSCLK is divided
//!
//! This function configures the clock rate of the LINACLK. The
//! \e divider parameter is the value by which the SYSCLK rate is divided to
//! get the LINACLK rate.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setLINAClock")))
static inline void
SysCtl_setLINAClock(SysCtl_LINClkDivider divider)
{
    HWREG(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) =
            (HWREG(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) &
                ~SYSCTL_PERCLKDIVSEL_LINACLKDIV_M) |
            ((uint32_t)divider << SYSCTL_PERCLKDIVSEL_LINACLKDIV_S);

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_PERCLKDIVSEL);
}

//*****************************************************************************
//
//! Sets the LINB clock.
//!
//! \param divider is the value by which PLLSYSCLK is divided
//!
//! This function configures the clock rate of the LINBCLK. The
//! \e divider parameter is the value by which the SYSCLK rate is divided to
//! get the LINBCLK rate.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setLINBClock")))
static inline void
SysCtl_setLINBClock(SysCtl_LINClkDivider divider)
{
    HWREG(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) =
            (HWREG(DEVCFG_BASE + SYSCTL_O_PERCLKDIVSEL) &
                ~SYSCTL_PERCLKDIVSEL_LINBCLKDIV_M) |
            ((uint32_t)divider << SYSCTL_PERCLKDIVSEL_LINBCLKDIV_S);

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_PERCLKDIVSEL);
}

//*****************************************************************************
//
//! Sets up Ethercat clock.
//!
//! \param divider is the value that configures the divider.
//! \param phyEnable enables/disables the etherCAT PHY clock
//!
//! This function sets up the Ethercat CLK divider based on the source that
//! is selected. There is only one divider that scales the "source" to
//! Ethercat CLK.
//! This also enables/disables the etherCAT PHY clock.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_ECatClkDivider
//! The \e source parameter can have one enumerated value from
//! SysCtl_PLLClockSource
//! The \e enable parameter can be either of these values:
//! 0x0U: etherCAT PHY clock is disabled
//! 0x1U: etherCAT PHY clock is enabled
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setECatClock")))
static inline void
SysCtl_setECatClock(SysCtl_ECatClkDivider divider, SysCtl_ECatPhyClk phyEnable)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_ETHERCATCLKCTL) =
            (HWREGH(DEVCFG_BASE + SYSCTL_O_ETHERCATCLKCTL) &
                ~(SYSCTL_ETHERCATCLKCTL_PHYCLKEN    |
                  SYSCTL_ETHERCATCLKCTL_ECATDIV_M)) |
            ((uint16_t)divider << SYSCTL_ETHERCATCLKCTL_ECATDIV_S) |
            (uint16_t)phyEnable;

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_ETHERCATCLKCTL);
}

//*****************************************************************************
//
//! Sets the CLB clock divider.
//!
//! \param divider  is the CLB clock divider.
//! \param tdivider is the CLB tile clock divider.
//! \param clkMode  is the mode for the clock for each of the instances
//!
//! This function sets up the CLB CLK configurations based on the instance
//! that is selected. There are 2 dividers that scales the "source" to CLB
//! CLK. The first one is the divider & the other the tile divider.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_CLBClkDivider
//! The \e tdivider parameter can have one enumerated value from
//! SysCtl_CLBTClkDivider
//! The \e clkMode parameter can be ORed value of :
//!  - SYSCTL_CLB1CLKMODE_SYNC or SYSCTL_CLB1CLKMODE_ASYNC
//!  - SYSCTL_CLB2CLKMODE_SYNC or SYSCTL_CLB2CLKMODE_ASYNC
//!  - SYSCTL_CLB3CLKMODE_SYNC or SYSCTL_CLB3CLKMODE_ASYNC
//!  - SYSCTL_CLB4CLKMODE_SYNC or SYSCTL_CLB4CLKMODE_ASYNC
//!  - SYSCTL_CLB5CLKMODE_SYNC or SYSCTL_CLB5CLKMODE_ASYNC
//!  - SYSCTL_CLB6CLKMODE_SYNC or SYSCTL_CLB6CLKMODE_ASYNC
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setCLBClock")))
static inline void
SysCtl_setCLBClock(SysCtl_CLBClkDivider divider, SysCtl_CLBTClkDivider tdivider,
                   uint8_t clkMode)
{
    HWREG(DEVCFG_BASE + SYSCTL_O_CLBCLKCTL) =
        ((uint32_t)divider << 0U) | ((uint32_t)tdivider << 4U) | clkMode;

    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_CLKSRCCTL2);
}

//*****************************************************************************
//
//! Sets the HSM clock.
//!
//! \param divider is the value by which PLLSYSCLK is divided
//!
//! This function configures the clock rate of the HSMCLK. The
//! \e divider parameter is the value by which the SYSCLK rate is divided to
//! get the HSMCLK rate.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setHSMClock")))
static inline void
SysCtl_setHSMClock(SysCtl_HSMClkDivider divider)
{
    HWREG(DEVCFG_BASE + SYSCTL_O_HSMCLKDIVSEL) =
            (HWREG(DEVCFG_BASE + SYSCTL_O_HSMCLKDIVSEL) &
                ~SYSCTL_HSMCLKDIVSEL_HSMCLKDIV_M) |
            ((uint32_t)divider << SYSCTL_HSMCLKDIVSEL_HSMCLKDIV_S);
}

//*****************************************************************************
//
//! Gets the external oscillator counter value.
//!
//! This function returns the X1 clock counter value. When the return value
//! reaches 0x3FF, it freezes. Before switching from INTOSC2 to an external
//! oscillator (XTAL), an application should call this function to make sure
//! the counter is saturated.
//!
//! \return Returns the value of the 10-bit X1 clock counter.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_getExternalOscCounterValue")))
static inline uint16_t
SysCtl_getExternalOscCounterValue(void)
{
    return(HWREGH(DEVCFG_BASE + SYSCTL_O_X1CNT) & SYSCTL_X1CNT_X1CNT_M);
}

//*****************************************************************************
//
//! Clears the external oscillator counter value.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_clearExternalOscCounterValue")))
static inline void
SysCtl_clearExternalOscCounterValue(void)
{
    HWREG(DEVCFG_BASE + SYSCTL_O_X1CNT) |= SYSCTL_X1CNT_CLR;
}

//*****************************************************************************
//
//! Turns on the the XTAL oscillator.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_turnOnXTAL")))
static inline void
SysCtl_turnOnXTAL(void)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_XTALCR) &= ~SYSCTL_XTALCR_OSCOFF;
    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_XTALCR);
}

//*****************************************************************************
//
//! Turns off the the XTAL oscillator.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_turnOffXTAL")))
static inline void
SysCtl_turnOffXTAL(void)
{
    HWREGH(DEVCFG_BASE + SYSCTL_O_XTALCR) |= SYSCTL_XTALCR_OSCOFF;
    SysCtl_pollSyncBusy(SYSCTL_SYNCBUSY_XTALCR);
}

//*****************************************************************************
//
//! Calculates the system clock frequency (SYSCLK).
//!
//! \param clockInHz is the frequency of the oscillator clock source (OSCCLK).
//!
//! This function determines the frequency of the system clock based on the
//! frequency of the oscillator clock source (from \e clockInHz) and the PLL
//! and clock divider configuration registers.
//!
//! \return Returns the system clock frequency. If a missing clock is detected,
//! the function will return the INTOSC1 frequency. This needs to be
//! corrected and cleared (see SysCtl_resetMCD()) before trying to call this
//! function again.
//
//*****************************************************************************
extern uint32_t
SysCtl_getClock(uint32_t clockInHz);

//*****************************************************************************
//
//! Configures the clocking of the device.
//!
//! \param config is the required configuration of the device clocking.
//!
//! This function configures the clocking of the device.  The input crystal
//! frequency, oscillator to be used, use of the PLL, and the system clock
//! divider are all configured with this function.
//!
//! \param oscSrc PLL Source. Can be one of the following values :
//!     - \b SYSCTL_OSCSRC_OSC2      - Internal Oscillator 2
//!     - \b SYSCTL_OSCSRC_XTAL      - External XTAL
//!     - \b SYSCTL_OSCSRC_XTAL_SE   - External XTAL Single-ended mode
//!     - \b SYSCTL_OSCSRC_OSC1      - Internal Oscillator 1
//!
//! \param pllConfig PLL configuration. Can be one fo the following values :
//!     - \b SYSCTL_PLL_ENABLE - This is to Enable the PLL Clock to the System
//!     - \b SYSCTL_PLL_BYPASS - This is to Bypass the PLLCLK from the System,
//!        this will also power up the PLL if the user desires to power up the
//!        PLL but not use it for System.
//!     - \b SYSCTL_PLL_DISABLE - This is to Power Down the PLL and Bypass the
//!        PLLCLK to the System.
//!
//! \param refDiv Reference Clock Divider. Use Enum SYSCTL_REFDIV_1..32
//! \param iMult  Multiplier. Use Enum SYSCTL_IMULT_4..127
//! \param oDiv   Output Clock Divider. Use Enum SYSCTL_ODIV_1..32
//! \param sysDiv SYSCLK Divider. Use Enum SYSCTL_SYSDIV_1..64
//! \param dccBase Base address of DCC module for PLL output validation
//!
//! This function uses the DCC to check that the PLLRAWCLK is running at the
//! expected rate. If you are using the DCC, you must back up its configuration
//! before calling this function and restore it afterward.
//! Locking PLL sequence is only done if the multipliers are updated.
//!
//! \note See your device errata for more details about locking the PLL.
//!
//! \return Returns \b false if a missing clock error is detected. This needs
//! to be cleared (see SysCtl_resetMCD()) before trying to call this function
//! again. Also, returns \b false if the PLLRAWCLK is not running and its
//! expected rate. Otherwise, returns \b true.
//
//*****************************************************************************
__attribute__((section(".text.link2.SysCtl_setClock")))
extern bool
SysCtl_setClock(Sysctl_PLLClockSource oscSrc, Sysctl_PLLConfig pllConfig,
                Sysctl_PLLRefDiv refDiv, Sysctl_PLLIMult iMult,
                Sysctl_PLLODiv oDiv, Sysctl_PLLSysDiv sysDiv, uint32_t dccBase);


//*****************************************************************************
//
//! Selects the oscillator to be used for the clocking of the device.
//!
//! \param oscSource is the oscillator source to be configured.
//!
//! This function configures the oscillator to be used in the clocking of the
//! device. The \e oscSource parameter may take a value of
//! \b SYSCTL_OSCSRC_OSC2, \b SYSCTL_OSCSRC_XTAL, \b SYSCTL_OSCSRC_XTAL_SE, or
//! \b SYSCTL_OSCSRC_OSC1.
//!
//! \sa SysCtl_turnOnOsc()
//!
//! \return None.
//
//*****************************************************************************
extern void
SysCtl_selectOscSource(uint32_t oscSource);


//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//****************************************************************************


//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // CLOCK_H
